{
  "_name_or_path": "microsoft/resnet-50",
  "architectures": [
    "ResNetForImageClassification"
  ],
  "depths": [
    3,
    4,
    6,
    3
  ],
  "downsample_in_bottleneck": false,
  "downsample_in_first_stage": false,
  "embedding_size": 64,
  "hidden_act": "relu",
  "hidden_sizes": [
    256,
    512,
    1024,
    2048
  ],
  "id2label": {
    "0": "Apple Braeburn",
    "1": "Apple Crimson Snow",
    "10": "Avocado ripe",
    "100": "Salak",
    "101": "Strawberry",
    "102": "Strawberry Wedge",
    "103": "Tamarillo",
    "104": "Tangelo",
    "105": "Tomato",
    "106": "Tomato Cherry Red",
    "107": "Tomato Heart",
    "108": "Tomato Maroon",
    "109": "Tomato Yellow",
    "11": "Banana",
    "110": "Tomato not Ripened",
    "111": "Walnut",
    "112": "Watermelon",
    "12": "Banana Lady Finger",
    "13": "Banana Red",
    "14": "Beetroot",
    "15": "Blueberry",
    "16": "Cactus fruit",
    "17": "Cantaloupe",
    "18": "Carambula",
    "19": "Cauliflower",
    "2": "Apple Golden",
    "20": "Cherry",
    "21": "Cherry Rainier",
    "22": "Cherry Wax Black",
    "23": "Cherry Wax Red",
    "24": "Cherry Wax Yellow",
    "25": "Chestnut",
    "26": "Clementine",
    "27": "Cocos",
    "28": "Corn",
    "29": "Corn Husk",
    "3": "Apple Granny Smith",
    "30": "Cucumber Ripe",
    "31": "Dates",
    "32": "Eggplant",
    "33": "Fig",
    "34": "Ginger Root",
    "35": "Granadilla",
    "36": "Grape Blue",
    "37": "Grape Pink",
    "38": "Grape White",
    "39": "Grapefruit Pink",
    "4": "Apple Pink Lady",
    "40": "Grapefruit White",
    "41": "Guava",
    "42": "Hazelnut",
    "43": "Huckleberry",
    "44": "Kaki",
    "45": "Kiwi",
    "46": "Kohlrabi",
    "47": "Kumquats",
    "48": "Lemon",
    "49": "Lemon Meyer",
    "5": "Apple Red",
    "50": "Limes",
    "51": "Lychee",
    "52": "Mandarine",
    "53": "Mango",
    "54": "Mango Red",
    "55": "Mangostan",
    "56": "Maracuja",
    "57": "Melon Piel de Sapo",
    "58": "Mulberry",
    "59": "Nectarine",
    "6": "Apple Red Delicious",
    "60": "Nectarine Flat",
    "61": "Nut Forest",
    "62": "Nut Pecan",
    "63": "Onion Red",
    "64": "Onion Red Peeled",
    "65": "Onion White",
    "66": "Orange",
    "67": "Papaya",
    "68": "Passion Fruit",
    "69": "Peach",
    "7": "Apple Red Yellow",
    "70": "Peach Flat",
    "71": "Pear",
    "72": "Pear Abate",
    "73": "Pear Forelle",
    "74": "Pear Kaiser",
    "75": "Pear Monster",
    "76": "Pear Red",
    "77": "Pear Stone",
    "78": "Pear Williams",
    "79": "Pepino",
    "8": "Apricot",
    "80": "Pepper Green",
    "81": "Pepper Orange",
    "82": "Pepper Red",
    "83": "Pepper Yellow",
    "84": "Physalis",
    "85": "Physalis with Husk",
    "86": "Pineapple",
    "87": "Pineapple Mini",
    "88": "Pitahaya Red",
    "89": "Plum",
    "9": "Avocado",
    "90": "Pomegranate",
    "91": "Pomelo Sweetie",
    "92": "Potato Red",
    "93": "Potato Red Washed",
    "94": "Potato Sweet",
    "95": "Potato White",
    "96": "Quince",
    "97": "Rambutan",
    "98": "Raspberry",
    "99": "Redcurrant"
  },
  "label2id": {
    "Apple Braeburn": "0",
    "Apple Crimson Snow": "1",
    "Apple Golden": "2",
    "Apple Granny Smith": "3",
    "Apple Pink Lady": "4",
    "Apple Red": "5",
    "Apple Red Delicious": "6",
    "Apple Red Yellow": "7",
    "Apricot": "8",
    "Avocado": "9",
    "Avocado ripe": "10",
    "Banana": "11",
    "Banana Lady Finger": "12",
    "Banana Red": "13",
    "Beetroot": "14",
    "Blueberry": "15",
    "Cactus fruit": "16",
    "Cantaloupe": "17",
    "Carambula": "18",
    "Cauliflower": "19",
    "Cherry": "20",
    "Cherry Rainier": "21",
    "Cherry Wax Black": "22",
    "Cherry Wax Red": "23",
    "Cherry Wax Yellow": "24",
    "Chestnut": "25",
    "Clementine": "26",
    "Cocos": "27",
    "Corn": "28",
    "Corn Husk": "29",
    "Cucumber Ripe": "30",
    "Dates": "31",
    "Eggplant": "32",
    "Fig": "33",
    "Ginger Root": "34",
    "Granadilla": "35",
    "Grape Blue": "36",
    "Grape Pink": "37",
    "Grape White": "38",
    "Grapefruit Pink": "39",
    "Grapefruit White": "40",
    "Guava": "41",
    "Hazelnut": "42",
    "Huckleberry": "43",
    "Kaki": "44",
    "Kiwi": "45",
    "Kohlrabi": "46",
    "Kumquats": "47",
    "Lemon": "48",
    "Lemon Meyer": "49",
    "Limes": "50",
    "Lychee": "51",
    "Mandarine": "52",
    "Mango": "53",
    "Mango Red": "54",
    "Mangostan": "55",
    "Maracuja": "56",
    "Melon Piel de Sapo": "57",
    "Mulberry": "58",
    "Nectarine": "59",
    "Nectarine Flat": "60",
    "Nut Forest": "61",
    "Nut Pecan": "62",
    "Onion Red": "63",
    "Onion Red Peeled": "64",
    "Onion White": "65",
    "Orange": "66",
    "Papaya": "67",
    "Passion Fruit": "68",
    "Peach": "69",
    "Peach Flat": "70",
    "Pear": "71",
    "Pear Abate": "72",
    "Pear Forelle": "73",
    "Pear Kaiser": "74",
    "Pear Monster": "75",
    "Pear Red": "76",
    "Pear Stone": "77",
    "Pear Williams": "78",
    "Pepino": "79",
    "Pepper Green": "80",
    "Pepper Orange": "81",
    "Pepper Red": "82",
    "Pepper Yellow": "83",
    "Physalis": "84",
    "Physalis with Husk": "85",
    "Pineapple": "86",
    "Pineapple Mini": "87",
    "Pitahaya Red": "88",
    "Plum": "89",
    "Pomegranate": "90",
    "Pomelo Sweetie": "91",
    "Potato Red": "92",
    "Potato Red Washed": "93",
    "Potato Sweet": "94",
    "Potato White": "95",
    "Quince": "96",
    "Rambutan": "97",
    "Raspberry": "98",
    "Redcurrant": "99",
    "Salak": "100",
    "Strawberry": "101",
    "Strawberry Wedge": "102",
    "Tamarillo": "103",
    "Tangelo": "104",
    "Tomato": "105",
    "Tomato Cherry Red": "106",
    "Tomato Heart": "107",
    "Tomato Maroon": "108",
    "Tomato Yellow": "109",
    "Tomato not Ripened": "110",
    "Walnut": "111",
    "Watermelon": "112"
  },
  "layer_type": "bottleneck",
  "model_type": "resnet",
  "num_channels": 3,
  "out_features": [
    "stage4"
  ],
  "out_indices": [
    4
  ],
  "problem_type": "single_label_classification",
  "stage_names": [
    "stem",
    "stage1",
    "stage2",
    "stage3",
    "stage4"
  ],
  "torch_dtype": "float32",
  "transformers_version": "4.48.3"
}
